src_doc/InformationRegisters/УчастникиМероприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УчастникиМероприятия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отсутствовал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеПриглашения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПриглашения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвкаОбязательна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСуммаПриглашения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеАдресаты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/Enums/СостоянияМероприятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияМероприятий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МатериалыВыступающихЗапрошены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериалыОтправленыНаОзнакомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученыМатериалыВыступающих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриглашенияНеПриняты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриглашенияОтправлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриглашенияПриняты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколГотовиться</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколИсполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколНаИсполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколНаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколНаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколНеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколНеУтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколПодготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколУтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМатериаламиОзнакомились</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МероприятиеВСтадииПодготовки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МероприятиеОтменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МероприятиеПроведено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммаНаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммаНеСогласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммаСогласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммаНаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммаУтверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммаНеУтверждена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_doc/CommonModules/УправлениеМероприятиямиВызовСервера/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль для работы с мероприятиями.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// По части наименования формирует список для выбора участника мероприятия.
//
// Параметры:
//  Текст - часть наименования, по которому выполняется поиск.
//
// Возвращает:
//  СписокЗначений - Список значений, содержащий ссылки на найденные по части наименования объекты
//
Функция СформироватьДанныеВыбораУчастника(Текст) Экспорт
	
	Возврат УправлениеМероприятиями.СформироватьДанныеВыбораУчастника(Текст);
	
КонецФункции

// По части наименования формирует список для выбора организатора мероприятия.
//
// Параметры:
//  Параметры - Параметры автоподбора.
//
// Возвращает:
//  СписокЗначений - Список значений, содержащий ссылки на найденные по части наименования объекты
//
Функция СформироватьДанныеВыбораОрганизатора(Параметры) Экспорт
	
	Возврат УправлениеМероприятиями.СформироватьДанныеВыбораОрганизатора(Параметры);
	
КонецФункции

// Меняет папку для массива мероприятий на новую.
//
// Параметры:
//  МассивМероприятий - Массив - Мероприятия, у которых необходимо изменить папку.
//  НоваяПапка - СправочникСсылка.ПапкиМероприятий - Новая папка мероприятий.
//
// Возвращаемое значение:
//  Булево - Успешное изменение папки мероприятий.
//
Функция ИзменитьПапкуМероприятий(МассивМероприятий, НоваяПапка) Экспорт
	
	Возврат УправлениеМероприятиями.ИзменитьПапкуМероприятий(МассивМероприятий, НоваяПапка);
	
КонецФункции

// По части наименования формирует список для выбора места проведения.
//
// Параметры:
//  Параметры - Параметры получения данных.
//
// Возвращает:
//  СписокЗначений - Список значений, содержащий ссылки на найденные по части наименования объекты.
//
Функция СформироватьДанныеВыбораМестаПроведения(Параметры) Экспорт
	
	Возврат УправлениеМероприятиями.СформироватьДанныеВыбораМестаПроведения(Параметры);
	
КонецФункции

// Заполняет протокол мероприятия на основании программы.
// Если протокол уже заполнен, то он будет очищен.
//
// Параметры:
//  Мероприятие - СправочникСсылка.Мероприятия - Мероприятие.
//
Процедура ЗаполнитьПротокол(Мероприятие) Экспорт
	
	УправлениеМероприятиями.ЗаполнитьПротокол(Мероприятие);
	
КонецПроцедуры

// Заполняет протокол мероприятия на основании протокола предыдущего мероприятия.
//
// Параметры:
//  Мероприятие - СправочникСсылка.Мероприятия - Мероприятие.
//
Процедура ЗаполнитьПротоколНаОснованииПредыдущего(Мероприятие) Экспорт
	
	УправлениеМероприятиями.ЗаполнитьПротоколНаОснованииПредыдущего(Мероприятие);
	
КонецПроцедуры

// Отправляет приглашения на мероприятия.
// 
// Параметры:
//  Мероприятие - СправочникСсылка.Мероприятия
//  ПроверитьОтсутствия - Булево
// 
// Возвращаемое значение:
//  Структура - Результат отправки приглашения:
//   * ПриглашенияОтправлены - Булево
//   * ТекстПредупреждения - Строка
//   * РезультатПроверкиОтсутствий - см. ОтсутствияКлиентСервер.НовыйРезультатПроверкиОтсутствий
//  
Функция ОтправитьПриглашения(Знач Мероприятие, Знач ПроверитьОтсутствия) Экспорт
	
	ПриглашенияОтправлены = Ложь;
	МассивТекстПредупреждения = Новый Массив;
	МассивТекстПредупреждения.Добавить(НСтр("ru = 'Не удалось отправить приглашение:'"));
	
	РеквизитыМероприятия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Мероприятие,
		"ПометкаУдаления, ВидМероприятия, ДатаНачала, ДатаОкончания");
	СостояниеПриглашений =
		УправлениеМероприятиями.ПолучитьСостояниеМероприятия(Мероприятие, "СостояниеПриглашений");
	СостояниеМероприятия =
		УправлениеМероприятиями.ПолучитьСостояниеМероприятия(Мероприятие, "СостояниеМероприятия");
	
	МожноОтправитьПриглашения = Истина;
	Если РеквизитыМероприятия.ПометкаУдаления Тогда
		
		МожноОтправитьПриглашения = Ложь;
		
		МассивТекстПредупреждения.Добавить(НСтр("ru = '- Мероприятия помечено на удаление.'"));
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РеквизитыМероприятия.ДатаНачала)
		Или Не ЗначениеЗаполнено(РеквизитыМероприятия.ДатаОкончания) Тогда
		
		МожноОтправитьПриглашения = Ложь;
		
		МассивТекстПредупреждения.Добавить(НСтр("ru = '- Не указано время проведения. Укажите начало и окончание.'"));
		
	КонецЕсли;
	
	Если СостояниеМероприятия = Перечисления.СостоянияМероприятий.МероприятиеОтменено Тогда
		
		МожноОтправитьПриглашения = Ложь;
		
		МассивТекстПредупреждения.Добавить(НСтр("ru = '- Мероприятия уже отменено.'"));
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СостояниеПриглашений) Тогда
		
		МожноОтправитьПриглашения = Ложь;
		
		МассивТекстПредупреждения.Добавить(НСтр("ru = '- Приглашения уже отправлены.'"));
		
	КонецЕсли;
	
	УчастникиМероприятия = УправлениеМероприятиями.ПолучитьУчастниковМероприятия(Мероприятие);
	Если УчастникиМероприятия.Количество() = 0 Тогда
		
		МожноОтправитьПриглашения = Ложь;
		
		МассивТекстПредупреждения.Добавить(НСтр("ru = '- Не указаны участники. Укажите участников.'"));
		
	КонецЕсли;
	
	ЕстьВнешниеУчастники = Ложь;
	Для Каждого СтрокаУчастника Из УчастникиМероприятия Цикл
		
		Если ЗначениеЗаполнено(СтрокаУчастника.СостояниеПриглашения) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоВнутреннийУчастник = УправлениеМероприятиями.ЭтоВнутреннийУчастник(
			СтрокаУчастника.Исполнитель);
		
		Если ЭтоВнутреннийУчастник Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьВнешниеУчастники = Истина;
		
		АдресДляОтправкиПриглашений = УправлениеМероприятиями.АдресДляОтправкиПриглашений(
			СтрокаУчастника.Исполнитель);
		Если Не ЗначениеЗаполнено(АдресДляОтправкиПриглашений) Тогда
			
			МожноОтправитьПриглашения = Ложь;
			
			МассивТекстПредупреждения.Добавить(
				СтрШаблон(
					НСтр("ru = '- Не указан адрес для отправки приглашений %1 (%2). Укажите состояние приглашения вручную или укажите адрес для отправки приглашений.'"),
					СтрокаУчастника.Исполнитель,
					ТипЗнч(СтрокаУчастника.Исполнитель)));
			
		КонецЕсли;
		
	КонецЦикла;
	Если ЕстьВнешниеУчастники И Не УправлениеМероприятиями.НастроенаОтправкаВнешнихПриглашений() Тогда
		
		МожноОтправитьПриглашения = Ложь;
		
		МассивТекстПредупреждения.Добавить(НСтр("ru = '- Не настроена отправка внешних приглашений. Укажите состояние приглашения вручную или обратитесь к администратору для настройки отправки приглашений.'"));
		
	КонецЕсли;
	
	Если МожноОтправитьПриглашения И ПроверитьОтсутствия Тогда
		РезультатПроверкиОтсутствий = Отсутствия.ПроверитьОтсутствияПоОбъекту(Мероприятие);
	Иначе
		РезультатПроверкиОтсутствий = ОтсутствияКлиентСервер.НовыйРезультатПроверкиОтсутствий();
	КонецЕсли;
	Если РезультатПроверкиОтсутствий.ЕстьОтсутствия Тогда
		МожноОтправитьПриглашения = Ложь;
	КонецЕсли;
	
	Если МожноОтправитьПриглашения Тогда
		ПриглашенияОтправлены = Истина;
		УправлениеМероприятиями.ОтправитьПриглашения(Мероприятие);
	КонецЕсли;
	
	РезультатОтправкиПриглашения = Новый Структура;
	РезультатОтправкиПриглашения.Вставить("ПриглашенияОтправлены", ПриглашенияОтправлены);
	РезультатОтправкиПриглашения.Вставить("ТекстПредупреждения", СтрСоединить(МассивТекстПредупреждения, Символы.ПС));
	РезультатОтправкиПриглашения.Вставить("РезультатПроверкиОтсутствий", РезультатПроверкиОтсутствий);
	
	Возврат РезультатОтправкиПриглашения;
	
КонецФункции

// Отменяет мероприятие.
// 
// Параметры:
//  Мероприятие - СправочникСсылка.Мероприятия.
//  
Процедура ОтменитьМероприятие(Знач Мероприятие) Экспорт
	
	УправлениеМероприятиями.ОтменитьМероприятие(Мероприятие);
	
КонецПроцедуры

// Параметры формы ввода пункта программы.
// 
// Параметры:
//  Мероприятие - СправочникСсылка.Мероприятия.
//  НомерПункта - Число.
// 
// Возвращаемое значение:
//  см. УправлениеМероприятиямиКлиентСервер.НовыйПараметрыФормыВводПунктаПрограммы.
// 
Функция ПараметрыФормыВводПунктаПрограммы(Знач Мероприятие, Знач НомерПункта) Экспорт
	
	ПараметрыФормы = УправлениеМероприятиямиКлиентСервер.НовыйПараметрыФормыВводПунктаПрограммы();
	
	РеквизитыМероприятия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Мероприятие,
		"ВидМероприятия, Программа");
	Программа = РеквизитыМероприятия.Программа.Выгрузить();
	Программа.Сортировать("НомерСтроки Возр");
	
	НайденнаяСтрока = Программа.Найти(НомерПункта, "НомерПункта");
	Если НайденнаяСтрока = Неопределено Тогда
		ПараметрыФормы.ПунктНеНайден = Истина;
		Возврат ПараметрыФормы;
	КонецЕсли;
	
	СостояниеПрограммы =
		УправлениеМероприятиями.ПолучитьСостояниеМероприятия(Мероприятие, "СостояниеПрограммы");
	
	ПараметрыФормы.НомерПункта = НайденнаяСтрока.НомерПункта;
	ПараметрыФормы.Исполнитель = НайденнаяСтрока.Исполнитель;
	ПараметрыФормы.Содержание = НайденнаяСтрока.Содержание;
	ПараметрыФормы.ВремяПлан = НайденнаяСтрока.ВремяПлан;
	ПараметрыФормы.ВремяФакт = НайденнаяСтрока.ВремяФакт;
	ПараметрыФормы.Начало = НайденнаяСтрока.Начало;
	ПараметрыФормы.Окончание = НайденнаяСтрока.Окончание;
	ПараметрыФормы.ТребуетПринятияРешения = НайденнаяСтрока.ТребуетПринятияРешения;
	ПараметрыФормы.Комментарий = НайденнаяСтрока.Комментарий;
	ПараметрыФормы.ВидМероприятия = РеквизитыМероприятия.ВидМероприятия;
	ПараметрыФормы.СостояниеПрограммы = СостояниеПрограммы;
	ПараметрыФормы.ТолькоПросмотр = Истина;
	
	Возврат ПараметрыФормы;
	
КонецФункции

// Возвращает список участников мероприятия
// 
// Параметры:
//  Мероприятие - СправочникСсылка.Мероприятия
// 
// Возвращаемое значение:
//  Участники - Массив из СправочникСсылка.Контрагенты, СправочникСсылка.ЛичныеАдресаты,
//                       СправочникСсылка.ПолныеРоли, СправочникСсылка.Пользователи,
//                       СправочникСсылка.КонтактныеЛица, СправочникСсылка.Сотрудники
// 
Функция УчастникиМероприятия(Знач Мероприятие) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	УчастникиМероприятия.Исполнитель
		|ИЗ
		|	РегистрСведений.УчастникиМероприятия КАК УчастникиМероприятия
		|ГДЕ
		|	УчастникиМероприятия.Мероприятие = &Мероприятие
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок");
	Запрос.УстановитьПараметр("Мероприятие", Мероприятие);
	
	Участники = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Исполнитель");
	
	Возврат Участники;
	
	
КонецФункции

#КонецОбласти
